configuration/src/Documents/Спринт/Спринт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Спринт</name>
  <comment>Документ для фиксации спринта по методологии Agile</comment>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпринта</name>
    <type>
      <types>EnumRef.ВидыСпринта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Спринт</types>
    </type>
  </attributes>
  <attributes>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Направления</name>
    <attributes>
      <name>Направление</name>
      <type>
        <types>CatalogRef.НаправленияРазработки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

configuration/src/Enums/ВидыСпринта/ВидыСпринта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСпринта</name>
  <enumValues>
    <name>IT</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееЗадание</name>
  </enumValues>
  <enumValues>
    <name>Планирование</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Documents/Спринт/Forms/ФормаСписка/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОтчет(Команда)
	
	ОткрытьФорму("Отчет.Спринты.ФормаОбъекта");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетРаботаСоСпринтами(Команда)
	
	ОткрытьФорму("Отчет.РаботаСоСпринтами.ФормаОбъекта");
	
КонецПроцедуры

#КонецОбласти       

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Создать_СпринтIT(Команда)
	
	СоздатьСпринт(ПредопределенноеЗначение("Перечисление.ВидыСпринта.IT"));
	
КонецПроцедуры

&НаКлиенте
Процедура Создать_СпринтЗадания(Команда)
	
	СоздатьСпринт(ПредопределенноеЗначение("Перечисление.ВидыСпринта.ВнутреннееЗадание"));
	
КонецПроцедуры

&НаКлиенте
Процедура Создать_СпринтПланирование(Команда)

	СоздатьСпринт(ПредопределенноеЗначение("Перечисление.ВидыСпринта.Планирование"));

КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура СоздатьСпринт(ВидСпринта)
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ВидСпринта", ВидСпринта);	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ПараметрыЗаполнения);
	
	ОткрытьФорму("Документ.Спринт.ФормаОбъекта", ПараметрыФормы);
		
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ТекущаяДата = НачалоДня(ТекущаяДатаСеанса());	
	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ДатаНачала");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = ТекущаяДата;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ДатаОкончания");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = ТекущаяДата;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ПометкаУдаления");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(229, 250, 221));

КонецПроцедуры

#КонецОбласти
